; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	image3 - mode
	infrared9 - mode
	image10 - mode
	thermograph11 - mode
	spectrograph7 - mode
	spectrograph5 - mode
	thermograph2 - mode
	thermograph8 - mode
	thermograph4 - mode
	image6 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared9)
	(calibration_target instrument0 Star2)
	(supports instrument1 image3)
	(supports instrument1 image6)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star0)
	(supports instrument2 image10)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph8)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph4)
	(supports instrument3 spectrograph7)
	(supports instrument3 thermograph11)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Planet5 thermograph2)
	(have_image Planet5 infrared9)
	(have_image Planet5 thermograph8)
	(have_image Phenomenon6 thermograph11)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon6 thermograph1)
	(have_image Phenomenon6 spectrograph7)
	(have_image Phenomenon7 image10)
	(have_image Phenomenon7 spectrograph7)
	(have_image Phenomenon7 spectrograph0)
	(have_image Planet8 thermograph8)
	(have_image Planet8 thermograph2)
	(have_image Planet8 spectrograph5)
	(have_image Planet9 thermograph8)
))

)

; plan
1. (turn_to satellite1 star2 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star2)
   goals met: 1 of 15
2. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   goals met: 0 of 15
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 15
4. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 15
5. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 15
6. (take_image satellite0 phenomenon7 instrument2 image10)
   added: (have_image phenomenon7 image10)
   goals met: 1 of 15
7. (turn_to satellite0 star2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star2)
   goals met: 1 of 15
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 15
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 15
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 15
11. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 1 of 15
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 15
13. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 1 of 15
14. (take_image satellite0 planet5 instrument0 infrared9)
   added: (have_image planet5 infrared9)
   goals met: 2 of 15
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 15
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 15
17. (turn_to satellite0 star0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star0)
   goals met: 2 of 15
18. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 15
19. (turn_to satellite0 planet8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet8)
   goals met: 2 of 15
20. (take_image satellite0 planet8 instrument1 spectrograph5)
   added: (have_image planet8 spectrograph5)
   goals met: 3 of 15
21. (turn_to satellite0 phenomenon6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 15
22. (take_image satellite0 phenomenon6 instrument1 image3)
   added: (have_image phenomenon6 image3)
   goals met: 5 of 15
23. (turn_to satellite1 phenomenon6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 15
24. (take_image satellite1 phenomenon6 instrument3 spectrograph7)
   added: (have_image phenomenon6 spectrograph7)
   goals met: 6 of 15
25. (take_image satellite1 phenomenon6 instrument3 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 7 of 15
26. (take_image satellite1 phenomenon6 instrument3 thermograph11)
   added: (have_image phenomenon6 thermograph11)
   goals met: 8 of 15
27. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 15
28. (take_image satellite1 phenomenon7 instrument3 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 9 of 15
29. (take_image satellite1 phenomenon7 instrument3 spectrograph7)
   added: (have_image phenomenon7 spectrograph7)
   goals met: 10 of 15
30. (turn_to satellite1 planet5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet5)
   goals met: 10 of 15
31. (take_image satellite1 planet5 instrument3 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 11 of 15
32. (take_image satellite1 planet5 instrument3 thermograph8)
   added: (have_image planet5 thermograph8)
   goals met: 12 of 15
33. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 12 of 15
34. (take_image satellite1 planet8 instrument3 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 13 of 15
35. (take_image satellite1 planet8 instrument3 thermograph8)
   added: (have_image planet8 thermograph8)
   goals met: 14 of 15
36. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 14 of 15
37. (take_image satellite1 planet9 instrument3 thermograph8)
   added: (have_image planet9 thermograph8)
   goals met: 15 of 15
